masifamu/PMSM_ESC_STM32F0_COOCOX/PEPL_functions.c
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource6, GPIO_AF_2);
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource8, GPIO_AF_2);
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource9, GPIO_AF_2);
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource10, GPIO_AF_2);

	// Time Base configuration
	TIM_TimeBaseStructure.TIM_Prescaler = 0;
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseStructure.TIM_Period = 0;
	TIM_TimeBaseStructure.TIM_ClockDivision = 0;
	TIM_TimeBaseStructure.TIM_RepetitionCounter = 0;
	TIM_TimeBaseInit(TIM1, &TIM_TimeBaseStructure);

	// Channel 1, 2, 3 – set to PWM mode - all 3 outputs
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_Timing;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_OutputNState = TIM_OutputNState_Disable;
	//TIM_OCInitStructure.TIM_Pulse = 200; // initialize to zero output

	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
	TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCNPolarity_Low;
	TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Reset; ///
	TIM_OCInitStructure.TIM_OCNIdleState = TIM_OCNIdleState_Reset; ///

	TIM_OCInitStructure.TIM_Pulse = 0; // initialize to zero output
	TIM_OC1Init(TIM1, &TIM_OCInitStructure);
	TIM_OCInitStructure.TIM_Pulse = 0; // initialize to zero output
	TIM_OC2Init(TIM1, &TIM_OCInitStructure);
	TIM_OCInitStructure.TIM_Pulse = 0; // initialize to zero output
	TIM_OC3Init(TIM1, &TIM_OCInitStructure);

	TIM_BDTRInitStructure.TIM_OSSRState = TIM_OSSRState_Enable;
	TIM_BDTRInitStructure.TIM_OSSIState = TIM_OSSIState_Enable;
	TIM_BDTRInitStructure.TIM_LOCKLevel = TIM_LOCKLevel_OFF;

	// DeadTime[ns] = value * (1/SystemCoreFreq) (on 72MHz: 7 is 98ns)
	//TIM_BDTRInitStructure.TIM_DeadTime = PMSM_NOL;

	TIM_BDTRInitStructure.TIM_AutomaticOutput = TIM_AutomaticOutput_Enable;

	// Break functionality
	TIM_BDTRInitStructure.TIM_Break = TIM_Break_Enable;
	TIM_BDTRInitStructure.TIM_BreakPolarity = TIM_BreakPolarity_Low;

	TIM_BDTRConfig(TIM1, &TIM_BDTRInitStructure);

	TIM_Cmd(TIM1, ENABLE);
	 // Enable motor timer main output (the bridge signals)
	TIM_CtrlPWMOutputs(TIM1, ENABLE);
}

/*..........................................................SPWM TIM1 ENDS HERE..................................................................*/
/*..........................................................PMSM CONTROL FUNCTIONS START HERE..................................................................*/
void PMSM_ConfigureEngine(void){
	PMSM_GPIOInit();
	PMSM_HallSensorsInit();
	USARTInit();
	PMSM_PWMTimerInit();
	PMSM_SpeedTimerInit();
	PMSM_SinTimerInit();
	PMSM_MotorStop();
}
void PMSM_SetEngineParameters(void){
	//TIM1 control
	TIM_SelectOCxM(TIM1, TIM_Channel_1, TIM_OCMode_PWM1);
	TIM_SelectOCxM(TIM1, TIM_Channel_2, TIM_OCMode_PWM1);
	TIM_SelectOCxM(TIM1, TIM_Channel_3, TIM_OCMode_PWM1);

	TIM1_PWM_PERIOD=PWM_PERIOD;
	//TIM1_CHANNEL_YH=100;
	//TIM1_CHANNEL_GH=200;
	//TIM1_CHANNEL_BH=300;

	//variable control
	//TIM14 control
	//TIM16 control
}
void PMSM_UpdateEnginePWMWidth(uint16_t pwmWidth){
	PMSM_PWM=pwmWidth;
}

uint8_t PMSM_HallSensorsGetPosition(void) {
	return (uint8_t)((GPIOB->IDR) & (HS_PINS))>>5;
}

// Stop a motor
void PMSM_MotorStop(void)
{
	//set PWM widths to zero
	PMSM_SetPWM(0);

	TIM_CCxCmd(TIM1, TIM_Channel_1, TIM_CCx_Disable);
	TIM_CCxCmd(TIM1, TIM_Channel_2, TIM_CCx_Disable);
	TIM_CCxCmd(TIM1, TIM_Channel_3, TIM_CCx_Disable);

	//disable lower switches here

	//disable both timers
	TIM_Cmd(TIM14, DISABLE);
	TIM_Cmd(TIM16, DISABLE);
	PMSM_Speed = 0;
	PMSM_Speed_prev = 0;
	PMSM_MotorRunFlag = 0;
	PMSM_ModeEnabled = 0;
}

// Set PWM (same for all phases)
void PMSM_SetPWM(uint16_t PWM)
{
	if (PMSM_ModeEnabled == 0) {
		TIM1_CHANNEL_YH = PWM;
		TIM1_CHANNEL_GH = PWM;
		TIM1_CHANNEL_BH = PWM;
	}
	else {
		PMSM_PWM = PWM;
	}
}

uint8_t PMSM_MotorSpeedIsOK(void) {
	return ((PMSM_Speed_prev > 800) & (PMSM_Speed > 800));
}

// Get index in sine table based on the sensor data, the timing and the direction of rotor rotation
uint8_t	PMSM_GetState(uint8_t SensorsPosition) {
	int16_t index;

	if (PMSM_MotorSpin == PMSM_CW) {
		index = PMSM_STATE_TABLE_INDEX_FORWARD[SensorsPosition];
	}
	else {
		index = PMSM_STATE_TABLE_INDEX_BACKWARD[SensorsPosition];
	}

	index = index + (int16_t)PMSM_Timing;
	if (index > PMSM_SINTABLESIZE-1) {
		index = index - PMSM_SINTABLESIZE;
	}
	else {
		if (index < 0) {
			index = PMSM_SINTABLESIZE + index;
		}
	}

	return index;
}

void PMSM_MotorCommutation(uint16_t hallpos){

	if (PMSM_MotorSpin == PMSM_CW) {
		memcpy(PMSM_STATE, PMSM_BRIDGE_STATE_FORWARD[hallpos], sizeof(PMSM_STATE));
	}
	else if(PMSM_MotorSpin == PMSM_CCW){
		memcpy(PMSM_STATE, PMSM_BRIDGE_STATE_BACKWARD[hallpos], sizeof(PMSM_STATE));
	}
	// Disable if need
	if (!PMSM_STATE[UH]) TIM_CCxCmd(TIM1,MOS_YH,TIM_CCx_Disable);//TIM1->CCR3=0;
	if (!PMSM_STATE[UL]) FIO_SET(GPIOB,MOS_YL);//GPIOB->BSRR = 0x0002;//Y
	if (!PMSM_STATE[VH]) TIM_CCxCmd(TIM1,MOS_GH,TIM_CCx_Disable);//TIM1->CCR2=0;
	if (!PMSM_STATE[VL]) FIO_SET(GPIOB,MOS_GL);//GPIOB->BSRR = 0x0001;//G
	if (!PMSM_STATE[WH]) TIM_CCxCmd(TIM1,MOS_BH,TIM_CCx_Disable);//TIM1->CCR1=0;
	if (!PMSM_STATE[WL]) FIO_SET(GPIOA,MOS_BL);//GPIOA->BSRR = 0x0080;//B

	// Enable if need. If previous state is Enabled then not enable again. Else output do flip-flop.
	if (PMSM_STATE[UH] & !PMSM_STATE[UL]) TIM_CCxCmd(TIM1,MOS_YH,TIM_CCx_Enable);//{ toUpdate = CH3; }
	if (PMSM_STATE[UL] & !PMSM_STATE[UH]) FIO_CLR(GPIOB,MOS_YL);//GPIOB->BRR = 0x0002;//Y
	if (PMSM_STATE[VH] & !PMSM_STATE[VL]) TIM_CCxCmd(TIM1,MOS_GH,TIM_CCx_Enable);//{	toUpdate = CH2; }
	if (PMSM_STATE[VL] & !PMSM_STATE[VH]) FIO_CLR(GPIOB,MOS_GL);//GPIOB->BRR = 0x0001;//G
	if (PMSM_STATE[WH] & !PMSM_STATE[WL]) TIM_CCxCmd(TIM1,MOS_BH,TIM_CCx_Enable);//{	toUpdate = CH1; }
	if (PMSM_STATE[WL] & !PMSM_STATE[WH]) FIO_CLR(GPIOA,MOS_BL);//GPIOA->BRR = 0x0080;//B
}
void PMSM_MotorLSCommutation(uint16_t hallLSpos){

