masifamu/PMSM_ESC_STM32F0_COOCOX/PEPL_functions.c
	if (PMSM_MotorSpin == PMSM_CW) {
		memcpy(PMSM_STATE, PMSM_BRIDGE_STATE_FORWARD[hallLSpos], sizeof(PMSM_STATE));
	}
	else if(PMSM_MotorSpin == PMSM_CCW){
		memcpy(PMSM_STATE, PMSM_BRIDGE_STATE_BACKWARD[hallLSpos], sizeof(PMSM_STATE));
	}
	// Disable if need
	if (!PMSM_STATE[UL]) FIO_SET(GPIOB,MOS_YL);//GPIOB->BSRR = 0x0002;//Y
	if (!PMSM_STATE[VL]) FIO_SET(GPIOB,MOS_GL);//GPIOB->BSRR = 0x0001;//G
	if (!PMSM_STATE[WL]) FIO_SET(GPIOA,MOS_BL);//GPIOA->BSRR = 0x0080;//B
	// Enable if need. If previous state is Enabled then not enable again. Else output do flip-flop.
	if (PMSM_STATE[UL] & !PMSM_STATE[UH]) FIO_CLR(GPIOB,MOS_YL);//GPIOB->BRR = 0x0002;//Y
	if (PMSM_STATE[VL] & !PMSM_STATE[VH]) FIO_CLR(GPIOB,MOS_GL);//GPIOB->BRR = 0x0001;//G
	if (PMSM_STATE[WL] & !PMSM_STATE[WH]) FIO_CLR(GPIOA,MOS_BL);//GPIOA->BRR = 0x0080;//B
}

void PMSM_MotorLS2Commutation(uint16_t sinTableIndex){

	if((sinTableIndex >= 129) & (sinTableIndex <= 191)){
		FIO_CLR(GPIOB,MOS_YL);
	}else{
		FIO_SET(GPIOB,MOS_YL);
	}
	if((sinTableIndex >= 1) & (sinTableIndex <= 63)){
		FIO_CLR(GPIOB,MOS_GL);
	}else{
		FIO_SET(GPIOB,MOS_GL);
	}
	if((sinTableIndex >= 65) & (sinTableIndex <= 127)){
		FIO_CLR(GPIOA,MOS_BL);
	}else{
		FIO_SET(GPIOA,MOS_BL);
	}

}


void PMSM_MotorSetRun(void) {
	PMSM_MotorRunFlag = 1;
}

void PMSM_MotorSetSpin(uint8_t spin) {
	PMSM_MotorSpin = spin;
}

uint8_t PMSM_MotorIsRun(void) {
	return PMSM_MotorRunFlag;
}

uint16_t PMSM_GetSpeed(void) {
	return PMSM_Speed;
}

// Transform ADC value to value for writing to the timer register
uint16_t PMSM_ADCToPWM(uint16_t ADC_VALUE) {
	uint32_t tmp;

	if (ADC_VALUE < PMSM_ADC_STOP) {
		return 0;
	} else {
		if (ADC_VALUE > PMSM_ADC_MAX) {
			return PWM_PERIOD+1;
		}
		else {
			tmp = (uint32_t)(ADC_VALUE-PMSM_ADC_STOP) * (uint32_t)PWM_PERIOD / (uint32_t)(PMSM_ADC_MAX - PMSM_ADC_START);
			return (uint16_t) tmp;
		}
	}
}

/*..........................................................PMSM_CONTROL FUNCTIONS END HERE..................................................................*/

/*..........................................................SPEED TIMER TIM14 STARTS HERE..................................................................*/
// Initialize TIM14. It is used to calculate the speed
void PMSM_SpeedTimerInit(void) {
	TIM_TimeBaseInitTypeDef TIMER_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;

	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM14, ENABLE);

	TIM_TimeBaseStructInit(&TIMER_InitStructure);
	TIMER_InitStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIMER_InitStructure.TIM_Prescaler = PMSM_SPEED_TIMER_PRESCALER;
	TIMER_InitStructure.TIM_Period = PMSM_SPEED_TIMER_PERIOD;
	TIM_TimeBaseInit(TIM14, &TIMER_InitStructure);
	TIM_ITConfig(TIM14, TIM_IT_Update, ENABLE);
	TIM_SetCounter(TIM14, 0);
	//TIM_Cmd(TIM14, ENABLE);

	// NVIC Configuration
	// Enable the TIM14_IRQn Interrupt
	NVIC_InitStructure.NVIC_IRQChannel = TIM14_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPriority=0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
}
void TIM14_IRQHandler(void) {
	if (TIM_GetITStatus(TIM14, TIM_IT_Update) != RESET)
	{
		TIM_ClearITPendingBit(TIM14, TIM_IT_Update);
		// Overflow - the motor is stopped
		if (PMSM_MotorSpeedIsOK()) {
			PMSM_MotorStop();

			FIO_SET(GPIOB,GREEN_LED);

		}
	}
}
/*..........................................................SPEED TIMER TIM14 ENDS HERE..................................................................*/

/*..........................................................SIN VALUE UPDATE TIM16 STARTS HERE..................................................................*/
// Initialize TIM16 which generate 3-phase sine signal
void PMSM_SinTimerInit(void) {
	TIM_TimeBaseInitTypeDef TIMER_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM16, ENABLE);

	TIM_TimeBaseStructInit(&TIMER_InitStructure);
	TIMER_InitStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIMER_InitStructure.TIM_Prescaler = PMSM_SPEED_TIMER_PRESCALER;
	TIMER_InitStructure.TIM_Period = 0;
	TIM_TimeBaseInit(TIM16, &TIMER_InitStructure);
	TIM_ITConfig(TIM16, TIM_IT_Update, ENABLE);
	//TIM_SetCounter(TIM16, 0);
	//TIM_Cmd(TIM16, ENABLE);

	// NVIC Configuration
	// Enable the TIM16_IRQn Interrupt
	NVIC_InitStructure.NVIC_IRQChannel = TIM16_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPriority=0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
}

// Calculate 3-phase PWM and increment position in sine table
void TIM16_IRQHandler(void) {

	if (TIM_GetITStatus(TIM16, TIM_IT_Update) != RESET)
	{
		TIM_ClearITPendingBit(TIM16, TIM_IT_Update);


		// If time to enable PMSM mode
		if (PMSM_ModeEnabled == 0) {
			//before starting the upper switches make sure that the lower switches are aligned with the PMSM_SinTableIndex to avoid overshoot.
			//PMSM_MotorLS2Commutation(PMSM_SinTableIndex);

			// Turn PWM outputs for working with sine wave
			TIM_CCxCmd(TIM1, MOS_YH, TIM_CCx_Enable);
			TIM_CCxCmd(TIM1, MOS_GH, TIM_CCx_Enable);
			TIM_CCxCmd(TIM1, MOS_BH, TIM_CCx_Enable);

			PMSM_ModeEnabled = 1;
		}

		// Calculate PWM for 3-phase
		if(PMSM_ModeEnabled == 1){
			TIM1_CHANNEL_YH = (uint16_t)((uint32_t)PMSM_PWM * PMSM_SINTABLE[PMSM_SinTableIndex][0]/255);
			TIM1_CHANNEL_GH = (uint16_t)((uint32_t)PMSM_PWM * PMSM_SINTABLE[PMSM_SinTableIndex][1]/255);
			TIM1_CHANNEL_BH = (uint16_t)((uint32_t)PMSM_PWM * PMSM_SINTABLE[PMSM_SinTableIndex][2]/255);
		}


		// Increment position in sine table
		PMSM_SinTableIndex++;
		if (PMSM_SinTableIndex > PMSM_SINTABLESIZE-1) {
			PMSM_SinTableIndex = 0;
		}

		PMSM_MotorLS2Commutation(PMSM_SinTableIndex);
	}
}
/*..........................................................SIN VALUE UPDATE TIM16 ENDS HERE..................................................................*/




/*..........................................................EXTI STARTS HERE..................................................................*/
// Configure GPIO, NVIC, EXTI for 3 Hall sensors
void PMSM_HallSensorsInit(void) {
	GPIO_InitTypeDef GPIO_InitStruct;
	EXTI_InitTypeDef EXTI_InitStruct;
	NVIC_InitTypeDef NVIC_InitStruct;

	// Enable clock
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB, ENABLE);

	// Init GPIO
	GPIO_InitStruct.GPIO_Pin = GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7;
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_IN;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_Level_3;
	GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_Init(GPIOB, &GPIO_InitStruct);

	/* Enable SYSCFG clock */
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

