masifamu/PMSM_ESC_STM32F0_COOCOX/PEPL_functions.c
	// Tell system that you will use PB lines for EXTI
	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOB, EXTI_PinSource5);
	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOB, EXTI_PinSource6);
	SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOB, EXTI_PinSource7);

	// Init NVIC
	NVIC_InitStruct.NVIC_IRQChannel = EXTI4_15_IRQn;
	NVIC_InitStruct.NVIC_IRQChannelPriority = 0x00;
	NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStruct);

    // EXTI
    EXTI_InitStruct.EXTI_Line = EXTI_Line5 | EXTI_Line6 | EXTI_Line7;
    EXTI_InitStruct.EXTI_LineCmd = ENABLE;
    EXTI_InitStruct.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStruct.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
    EXTI_Init(&EXTI_InitStruct);
}
// Every time when hall sensors change state executed this IRQ handler
void EXTI4_15_IRQHandler(void) {
    if ((EXTI_GetITStatus(EXTI_Line5) | EXTI_GetITStatus(EXTI_Line6) | EXTI_GetITStatus(EXTI_Line7)) != RESET) {
    	// Clear interrupt flag
    	EXTI_ClearITPendingBit(EXTI_Line5);
    	EXTI_ClearITPendingBit(EXTI_Line6);
    	EXTI_ClearITPendingBit(EXTI_Line7);

    	PMSM_Sensors=PMSM_HallSensorsGetPosition();

    	//if(PMSM_Sensors != PMSM_Sensors_prev){
    	//	PMSM_Sensors_prev=PMSM_Sensors;
			sniprintf(TXBUFFERF,20,"%d\r\n",PMSM_Sensors);
			USARTSend(TXBUFFERF);


			PMSM_Speed_prev = PMSM_Speed;
			//calculate the current speed of rotor by getting the counter value of TIM14
			PMSM_Speed = TIM_GetCounter(TIM14);//TIM14->CNT;//get speed
			TIM_Cmd(TIM14, ENABLE);//TIM14->CR1|=TIM_CR1_CEN;//enable
			TIM_SetCounter(TIM14, 0);//TIM14->CNT = 0;//set

			//setting to TIM16
/*			if(PMSM_MotorSpeedIsOK()){
				TIM16->CNT = 0;
				TIM16->ARR = PMSM_Speed/32;
				TIM16->CR1 |= TIM_CR1_CEN;
				//USARTSend("from speed okay\r\n");
			}

			// If Hall sensors value is valid
			if ((PMSM_Sensors > 0 ) & (PMSM_Sensors < 7)) {
				// Do a phase correction
				PMSM_SinTableIndex = PMSM_GetState(PMSM_Sensors);
				//USARTSend("from hs okay\r\n");
			}
*/
			// If motor is started then used a block commutation
			if (PMSM_ModeEnabled == 0) {
				PMSM_MotorCommutation(PMSM_Sensors);
				//USARTSend("commutation again\r\n");
			}//else{
				//PMSM_MotorLSCommutation(PMSM_Sensors);
			//}

			FIO_FLP(GPIOB,YELLOW_LED);//Yellow LED


			//USARTSend("from EXTI IRQ\r\n");
			//sniprintf(TXBUFFERF,20,"%d\r\n",PMSM_Speed);
			//USARTSend(TXBUFFERF);
    	//}
    }
}
/*..........................................................EXTI ENDS HERE..................................................................*/



/*..........................................................UART START HERE..................................................................*/
void USARTInit(void)
{
    GPIO_InitTypeDef GPIO_InitStructure;
    USART_InitTypeDef USART_InitStructure;

    /* USARTx configured as follow:
    - BaudRate = 115200 baud
    - Word Length = 8 Bits
    - One Stop Bit
    - No parity
    - Hardware flow control disabled (RTS and CTS signals)
    - Receive and transmit enabled
    */
    USART_InitStructure.USART_BaudRate = 115200;
    USART_InitStructure.USART_WordLength = USART_WordLength_8b;
    USART_InitStructure.USART_StopBits = USART_StopBits_1;
    USART_InitStructure.USART_Parity = USART_Parity_No;
    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

    /* Enable GPIO clock */
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE);

    /* Enable USART clock */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);

    /* Connect PXx to USARTx_Tx */
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_1);

    /* Connect PXx to USARTx_Rx */
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_1);

    /* Configure USART Tx, Rx as alternate function push-pull */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2 | GPIO_Pin_3;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_Level_3;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    /* USART configuration */
    USART_Init(USART1, &USART_InitStructure);

    /* Enable USART */
    USART_Cmd(USART1, ENABLE);

}
void USARTSend(char *pucBuffer)
{
    while (*pucBuffer)
    {
        USART_SendData(USART1, *pucBuffer++);
        while(USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET)
        {
        }
    }
}
/*..........................................................UART ENDS HERE..................................................................*/
